<script setup lang="ts">
/* <script setup>: Это синтаксис Composition API, который позволяет более лаконично и удобно писать компоненты Vue.-->> 
В данном случае мы используем `lang='ts'`, что указывает на использование TypeScript.*/
</script>


<template>
<!-- <template>: Этот блок определяет разметку компонента. 
В нашем случае он содержит один элемент – <div> с классами для стилизации и контейнером для отображения маршрутов, который мы взяли от Tailwind CSS.

<router-view />: Это специальный компонент Vue Router, который служит местом для отображения компонентов, соответствующих текущему маршруту. 
Когда пользователь переходит по различным маршрутам, содержимое этого элемента будет обновляться в зависимости от того, какой маршрут активен. 
Это позволяет создавать одностраничные приложения (SPA), где страницы загружаются динамически без перезагрузки. -->
  <div class="container mx-auto p-4">
    <router-view />
  </div>
</template>


<style scoped>
/*! <style scoped>: Этот блок предназначен для стилизации компонента. 
Атрибут scoped гарантирует, что стили будут применяться только к этому компоненту, а не ко всем элементам на странице. 
В данном случае он пустой, но вы можете добавить стили в будущем для улучшения визуального оформления вашего приложения.-->>*/
</style>